package chapter05.ex09;

public class Ex01 {

	public static void main(String[] args) {
		/*  <완료시간 6:00>  p.jangwoo@gmail.com
	  국어 영어 수학  과학   	   국어  영어 수학 과학      국어   영어  수학   과학	       국어   영어   수학  과학
홍길동  70  88  77   99   이순신   80  68  87  79  김똘똘  60   86  87    30     홍길순    77      56      80     99

메인 메소드 args 로 아래와 같은 값이 인풋 되었을 경우 <출력> 과 같이 출력해 보세요 
args :  홍길동 70 88 77 99 이순신 80 68 87 79 김똘똘 60 86 87 30 홍길순 77 56 80 99

<for 문을 사용해서 출력 하세요> 

<출력> 
	     국어      영어      수학     과학        <합계>    <평균>
============================================================
홍길동     70      88       77        99	
이순신     80      68       87        79 
김똘똘     60      86       87        30
홍길순     77      56       80        99
============================================================
<합계> 
<평균> 	 
		 */
				

	}

}
